# FamilyTypeSetIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyTypeSetIterator Class
Members See Also
---
An iterator to a FamilyType set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class FamilyTypeSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class FamilyTypeSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class FamilyTypeSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..FamilyTypeSetIterator
# See Also
FamilyTypeSetIterator Members
Autodesk.Revit.DB Namespace